In [179]:
import pandas as pd

# Sample dataset
data = {
    'transaction_id': [1, 2, 3, 4, 5,6],
    'product': ['A', 'B', 'A', 'C', 'B','A'],
    'quantity': [10, 20, 30, 40, 50,50],
    'price_per_unit': [100, 150, 100, 200, 150,110],
    'date': ['2021-01-01', '2021-01-02', '2021-01-02', '2021-01-04', '2021-01-05','2021-02-06']
}

df = pd.DataFrame(data)

# Task 1: Calculate the total revenue for each product.
# Task 2: Add a new column 'total_revenue' which is the product of 'quantity' and 'price_per_unit'.
# Task 3: Filter the dataframe to include only transactions with a total price greater than 2000.
# Task 4: Group the data by product and calculate the total quantity sold for each product.
# Task 5: Convert the 'date' column to datetime format and set it as the index of the dataframe.

print(df)

   transaction_id product  quantity  price_per_unit        date
0               1       A        10             100  2021-01-01
1               2       B        20             150  2021-01-02
2               3       A        30             100  2021-01-02
3               4       C        40             200  2021-01-04
4               5       B        50             150  2021-01-05
5               6       A        50             110  2021-02-06

### **Task 1: Calculate the total revenue for each product.**

In [180]:
df["total_price"] = df["quantity"] * df["price_per_unit"]
df

   transaction_id product  quantity  price_per_unit        date  total_price
0               1       A        10             100  2021-01-01         1000
1               2       B        20             150  2021-01-02         3000
2               3       A        30             100  2021-01-02         3000
3               4       C        40             200  2021-01-04         8000
4               5       B        50             150  2021-01-05         7500
5               6       A        50             110  2021-02-06         5500

In [181]:
total_revenue_for_eachprod = df.groupby("product")["total_price"].sum()
total_revenue_for_eachprod

product
A     9500
B    10500
C     8000
Name: total_price, dtype: int64

### **Task 3: Filter the dataframe to include only transactions with a total price greater than 2000.**

In [182]:
filtered_df = df[df["total_price"] > 2000]
filtered_df

   transaction_id product  quantity  price_per_unit        date  total_price
1               2       B        20             150  2021-01-02         3000
2               3       A        30             100  2021-01-02         3000
3               4       C        40             200  2021-01-04         8000
4               5       B        50             150  2021-01-05         7500
5               6       A        50             110  2021-02-06         5500

### **Task 4: Group the data by product and calculate the total quantity sold for each product.**

In [183]:
tot_quantity_for_eachprod = df.groupby("product")["quantity"].sum()
tot_quantity_for_eachprod

product
A    90
B    70
C    40
Name: quantity, dtype: int64

### **Task 5: Convert the 'date' column to datetime format and set it as the index of the dataframe.**

In [184]:
df["date"] = pd.to_datetime(df["date"])
df.set_index("date", inplace = True)
df

            transaction_id product  quantity  price_per_unit  total_price
date
2021-01-01               1       A        10             100         1000
2021-01-02               2       B        20             150         3000
2021-01-02               3       A        30             100         3000
2021-01-04               4       C        40             200         8000
2021-01-05               5       B        50             150         7500
2021-02-06               6       A        50             110         5500

### **Task 6: Calculate the average price per unit for each product**

In [185]:
avg_price_perunit_of_eachprod = (df.groupby("product")["price_per_unit"].mean()).round(3)
avg_price_perunit_of_eachprod

product
A    103.333
B    150.000
C    200.000
Name: price_per_unit, dtype: float64

### **Task 7: Determine the day with the highest total revenue**

In [186]:
highest_tot_rev_day = df["total_price"].idxmax()
print(highest_tot_rev_day)

2021-01-04 00:00:00

In [187]:
# top 2 highest
highest_tot_rev_day = df["total_price"].nlargest(2)
print(highest_tot_rev_day)

date
2021-01-04    8000
2021-01-05    7500
Name: total_price, dtype: int64

### **Task 8: Calculate the cumulative revenue over time**

In [188]:
df["cumulative_revenue"] = df["total_price"].cumsum()
df

,transaction_id,product,quantity,price_per_unit,total_price,cumulative_revenue
date,,,,,,
2021-01-01,1,A,10,100,1000,1000
2021-01-02,2,B,20,150,3000,4000
2021-01-02,3,A,30,100,3000,7000
2021-01-04,4,C,40,200,8000,15000
2021-01-05,5,B,50,150,7500,22500
2021-02-06,6,A,50,110,5500,28000

### **Task 9: Add a new column 'discounted_price' which is 90% of the 'total_price'**

In [189]:
df['discounted_price'] = df['total_price'] * 0.9
df

,transaction_id,product,quantity,price_per_unit,total_price,cumulative_revenue,discounted_price
date,,,,,,,
2021-01-01,1,A,10,100,1000,1000,900.0
2021-01-02,2,B,20,150,3000,4000,2700.0
2021-01-02,3,A,30,100,3000,7000,2700.0
2021-01-04,4,C,40,200,8000,15000,7200.0
2021-01-05,5,B,50,150,7500,22500,6750.0
2021-02-06,6,A,50,110,5500,28000,4950.0

### **Task 10: Filter the DataFrame to include only transactions where the quantity sold is above the average quantity sold**

In [190]:
avg_qut = df["quantity"].mean()
print("avg_qut: ",avg_qut.round(3))
filterd_trx_above_avg_quantity = df[df["quantity"] > avg_qut]
filterd_trx_above_avg_quantity

avg_qut:  33.333

,transaction_id,product,quantity,price_per_unit,total_price,cumulative_revenue,discounted_price
date,,,,,,,
2021-01-04,4,C,40,200,8000,15000,7200.0
2021-01-05,5,B,50,150,7500,22500,6750.0
2021-02-06,6,A,50,110,5500,28000,4950.0

### **Task 11: Add a new column 'month' extracted from the 'date' column**

In [191]:
df['month'] = df.index.month
df

,transaction_id,product,quantity,price_per_unit,total_price,cumulative_revenue,discounted_price,month
date,,,,,,,,
2021-01-01,1,A,10,100,1000,1000,900.0,1
2021-01-02,2,B,20,150,3000,4000,2700.0,1
2021-01-02,3,A,30,100,3000,7000,2700.0,1
2021-01-04,4,C,40,200,8000,15000,7200.0,1
2021-01-05,5,B,50,150,7500,22500,6750.0,1
2021-02-06,6,A,50,110,5500,28000,4950.0,2

### **Task 12: Calculate the total revenue for each month**

In [192]:
total_rev = df.groupby('month')["total_price"].sum()
total_rev

month
1    22500
2     5500
Name: total_price, dtype: int64

### **Task 13: Create a pivot table showing the total revenue for each product for each day**

In [193]:
pivot_table = df.pivot_table(values='total_price', index=df.index, columns='product', aggfunc='sum')
pivot_table

product          A       B       C
date
2021-01-01  1000.0     NaN     NaN
2021-01-02  3000.0  3000.0     NaN
2021-01-04     NaN     NaN  8000.0
2021-01-05     NaN  7500.0     NaN
2021-02-06  5500.0     NaN     NaN

### **Task 10: Resample the DataFrame to show weekly total revenue**

In [200]:
weekly_rev = df.resample('w')["total_price"].sum()
weekly_rev

date
2021-01-03     7000
2021-01-10    15500
2021-01-17        0
2021-01-24        0
2021-01-31        0
2021-02-07     5500
Freq: W-SUN, Name: total_price, dtype: int64